ConfigFiles/InformationRegisters/ИзмененияВВетках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияВВетках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодробноеОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСогласованияИзмененийВВетках</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановилСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзмененияСтатусаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущееПодробноеОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатусСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСогласованияИзмененийВВетках</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоммитСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущаяДатаИзмененияСтатусаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийУстановилСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИзмененийОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.МакетыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.ФормыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:EnumRef.ТипыМодулейОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.КомандыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/InformationRegisters/ИзмененияВВетках/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ПривилегированныйРежим() ИЛИ УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьРазрешениеИзмененияПоВеткам(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьРазрешениеИзмененияПоВеткам(Отказ)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ОтборПоВетке = ЭтотОбъект.Отбор.Ветка.Использование;
	ОтборПоОбъектуМетаданных = ЭтотОбъект.Отбор.ОбъектМетаданных.Использование;
	ОтборПоПодчиненномуОбъекту = ЭтотОбъект.Отбор.ПодчиненныйОбъект.Использование;
	
	Ветка = ЭтотОбъект.Отбор.Ветка.Значение;
	ОбъектМетаданных = ЭтотОбъект.Отбор.ОбъектМетаданных.Значение;
	ПодчиненныйОбъект = ЭтотОбъект.Отбор.ПодчиненныйОбъект.Значение;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИзмененияВВетках.Ветка КАК Ветка,
	|	Ветки.Владелец КАК Проект,
	|	ЛОЖЬ КАК ЕстьРазрешение
	|ПОМЕСТИТЬ ВТВеткиИПроекты
	|ИЗ
	|	РегистрСведений.ИзмененияВВетках КАК ИзмененияВВетках
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ветки КАК Ветки
	|		ПО ИзмененияВВетках.Ветка = Ветки.Ссылка
	|ГДЕ
	|	(&ОтборПоВетке
	|				И ИзмененияВВетках.Ветка = &Ветка
	|			ИЛИ НЕ &ОтборПоВетке)
	|	И (&ОтборПоОбъектуМетаданных
	|				И ИзмененияВВетках.ОбъектМетаданных = &ОбъектМетаданных
	|			ИЛИ НЕ &ОтборПоОбъектуМетаданных)
	|	И (&ОтборПоПодчиненномуОбъекту
	|				И ИзмененияВВетках.ПодчиненныйОбъект = &ПодчиненныйОбъект
	|			ИЛИ НЕ &ОтборПоПодчиненномуОбъекту)
	|   И ИзмененияВВетках.Согласующий <> &ТекущийПользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТВеткиИПроекты.Проект КАК Проект
	|ИЗ
	|	ВТВеткиИПроекты КАК ВТВеткиИПроекты"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтборПоВетке", ОтборПоВетке);
	Запрос.УстановитьПараметр("ОтборПоОбъектуМетаданных", ОтборПоОбъектуМетаданных);
	Запрос.УстановитьПараметр("ОтборПоПодчиненномуОбъекту", ОтборПоПодчиненномуОбъекту );
	Запрос.УстановитьПараметр("Ветка", Ветка);
	Запрос.УстановитьПараметр("ОбъектМетаданных", ОбъектМетаданных);
	Запрос.УстановитьПараметр("ПодчиненныйОбъект", ПодчиненныйОбъект);
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СписокПроектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");
	
	РазрешенияПоВеткам = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТВеткиИПроекты"].ПолучитьДанные().Выгрузить();
	
	РазрешенияПоПроектам =  Новый Соответствие;
	
	Для Каждого Проект из СписокПроектов Цикл
		ЕстьРазрешение = УправлениеДоступомСППР.РольДоступнаПоПроекту("ЗаписьИзмененийМетаданныхЗаДругихСогласующих", Проект);
		РазрешенияПоПроектам.Вставить(Проект, ЕстьРазрешение);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы из РазрешенияПоВеткам Цикл
		
		СтрокаТаблицы.ЕстьРазрешение = РазрешенияПоПроектам.Получить(СтрокаТаблицы.Проект);
		
		Если НЕ СтрокаТаблицы.ЕстьРазрешение Тогда
			ТекстСообщения = НСтр("ru='Текущему пользователю запрещено изменять записи, в которых он не является согласующим, по ветке %Ветка%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ветка%", СтрокаТаблицы.Ветка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
